IdeaRS.OpenModel.Model.HingeElement1D
Representation of hinge element 1D

IdeaRS.OpenModel.Model.HingeElement1D.InitialStiffnessX
Initial stiffness X dirrection

IdeaRS.OpenModel.Model.HingeElement1D.InitialStiffnessY
Initial stiffness Y dirrection

IdeaRS.OpenModel.Model.HingeElement1D.InitialStiffnessZ
Initial stiffness Z dirrection

IdeaRS.OpenModel.Model.HingeElement1D.InitialStiffnessRX
Initial stiffness rotational RX

IdeaRS.OpenModel.Model.HingeElement1D.InitialStiffnessRY
Initial stiffness rotational RY

IdeaRS.OpenModel.Model.HingeElement1D.InitialStiffnessRZ
Initial stiffness rotational RZ

IdeaRS.OpenModel.Model.HingeElement1D.HingeTypeX
Hinge type in dirrection X

IdeaRS.OpenModel.Model.HingeElement1D.HingeTypeY
Hinge type in dirrection Y

IdeaRS.OpenModel.Model.HingeElement1D.HingeTypeZ
Hinge type in dirrection Z

IdeaRS.OpenModel.Model.HingeElement1D.HingeTypeRX
Hinge type in dirrection round X

IdeaRS.OpenModel.Model.HingeElement1D.HingeTypeRY
Hinge type in dirrection round Y

IdeaRS.OpenModel.Model.HingeElement1D.HingeTypeRZ
Hinge type in dirrection round Z